# -*- coding: utf-8 -*-
#===================================================================================
#python历史：https://zh.wikipedia.org/wiki/Python
#编程语言排行版https://www.tiobe.com/tiobe-index/
#解释型、通用型、高级编程语言
#python的优点：简单，移植性强
#python的缺点：执行效率低，代码无法加密

#===================================================================================
#python解释的安装
##windows环境：
##mac环境：
##Linux环境：

#===================================================================================
#python开发工具：anoconda,pycharm,vscode。。。
#pycharm

print("hello python!")
#===================================================================================
#变量命名规则
#常量，变量，函数，类，模块
'''
硬性规则：
变量名由字母（广义的Unicode字符，不包括特殊字符）、数字和下划线构成，数字不能开头。
大小写敏感（大写的a和小写的A是两个不同的变量）。
不要跟关键字（有特殊含义的单词，后面会讲到）和系统保留字（如函数、模块等的名字）冲突。
PEP 8要求：
用小写字母拼写，多个单词用下划线连接。
受保护的实例属性用单个下划线开头（后面会讲到）。
私有的实例属性用两个下划线开头（后面会讲到）。
'''

#===================================================================================
